const weather =[
  {
    "publishingOffice": "気象庁",
    "reportDatetime": "2024-12-03T17:00:00+09:00",
    "timeSeries": [
      {
        "timeDefines": [
          "2024-12-03T17:00:00+09:00",
          "2024-12-04T00:00:00+09:00",
          "2024-12-05T00:00:00+09:00"
        ],
        "areas": [
          {
            "area": {
              "name": "東京地方",
              "code": "130010"
            },
            "weatherCodes": [
              "111",
              "101",
              "101"
            ],
            "weathers": [
              "晴れ　夜遅く　くもり",
              "晴れ　朝晩　くもり",
              "晴れ　時々　くもり"
            ],
            "winds": [
              "南西の風　２３区西部　では　南西の風　やや強く",
              "北の風",
              "北の風　後　南東の風"
            ],
            "waves": [
              "１メートル",
              "０．５メートル",
              "０．５メートル"
            ]
          },
          {
            "area": {
              "name": "伊豆諸島北部",
              "code": "130020"
            },
            "weatherCodes": [
              "111",
              "101",
              "101"
            ],
            "weathers": [
              "晴れ　夜遅く　くもり",
              "晴れ　時々　くもり",
              "晴れ　時々　くもり"
            ],
            "winds": [
              "南西の風　やや強く",
              "南西の風　やや強く　後　北東の風",
              "西の風　やや強く　後　南西の風　やや強く"
            ],
            "waves": [
              "１．５メートル",
              "１．５メートル　後　２メートル　ただし　新島　では　２メートル　後　２．５メートル",
              "２メートル　ただし　新島　では　２．５メートル"
            ]
          },
          {
            "area": {
              "name": "伊豆諸島南部",
              "code": "130030"
            },
            "weatherCodes": [
              "111",
              "210",
              "201"
            ],
            "weathers": [
              "晴れ　夜　くもり　所により　雨　で　雷を伴う",
              "くもり　昼前　から　時々　晴れ　所により　明け方　まで　雨　で　雷を伴う",
              "くもり　時々　晴れ"
            ],
            "winds": [
              "西の風　後　やや強く",
              "西の風　やや強く",
              "西の風　やや強く"
            ],
            "waves": [
              "１．５メートル　うねり　を伴う",
              "１．５メートル　後　２．５メートル　ただし　三宅島　では　２メートル　後　２．５メートル",
              "２．５メートル"
            ]
          },
          {
            "area": {
              "name": "小笠原諸島",
              "code": "130040"
            },
            "weatherCodes": [
              "200",
              "214",
              "200"
            ],
            "weathers": [
              "くもり　所により　雨",
              "くもり　昼過ぎ　から　雨　所により　雷　を伴う",
              "くもり"
            ],
            "winds": [
              "東の風",
              "東の風　後　北の風",
              "北の風"
            ],
            "waves": [
              "２メートル　うねり　を伴う",
              "２．５メートル　後　２メートル　うねり　を伴う",
              "２メートル　うねり　を伴う"
            ]
          }
        ]
      },
      {
        "timeDefines": [
          "2024-12-03T18:00:00+09:00",
          "2024-12-04T00:00:00+09:00",
          "2024-12-04T06:00:00+09:00",
          "2024-12-04T12:00:00+09:00",
          "2024-12-04T18:00:00+09:00"
        ],
        "areas": [
          {
            "area": {
              "name": "東京地方",
              "code": "130010"
            },
            "pops": [
              "0",
              "0",
              "0",
              "0",
              "0"
            ]
          },
          {
            "area": {
              "name": "伊豆諸島北部",
              "code": "130020"
            },
            "pops": [
              "10",
              "10",
              "0",
              "10",
              "10"
            ]
          },
          {
            "area": {
              "name": "伊豆諸島南部",
              "code": "130030"
            },
            "pops": [
              "40",
              "30",
              "10",
              "10",
              "10"
            ]
          },
          {
            "area": {
              "name": "小笠原諸島",
              "code": "130040"
            },
            "pops": [
              "20",
              "30",
              "40",
              "60",
              "60"
            ]
          }
        ]
      },
      {
        "timeDefines": [
          "2024-12-04T00:00:00+09:00",
          "2024-12-04T09:00:00+09:00"
        ],
        "areas": [
          {
            "area": {
              "name": "東京",
              "code": "44132"
            },
            "temps": [
              "9",
              "18"
            ]
          },
          {
            "area": {
              "name": "大島",
              "code": "44172"
            },
            "temps": [
              "14",
              "18"
            ]
          },
          {
            "area": {
              "name": "八丈島",
              "code": "44263"
            },
            "temps": [
              "15",
              "18"
            ]
          },
          {
            "area": {
              "name": "父島",
              "code": "44301"
            },
            "temps": [
              "22",
              "25"
            ]
          }
        ]
      }
    ]
  },
  {
    "publishingOffice": "気象庁",
    "reportDatetime": "2024-12-03T17:00:00+09:00",
    "timeSeries": [
      {
        "timeDefines": [
          "2024-12-04T00:00:00+09:00",
          "2024-12-05T00:00:00+09:00",
          "2024-12-06T00:00:00+09:00",
          "2024-12-07T00:00:00+09:00",
          "2024-12-08T00:00:00+09:00",
          "2024-12-09T00:00:00+09:00",
          "2024-12-10T00:00:00+09:00"
        ],
        "areas": [
          {
            "area": {
              "name": "東京地方",
              "code": "130010"
            },
            "weatherCodes": [
              "101",
              "101",
              "101",
              "101",
              "201",
              "101",
              "101"
            ],
            "pops": [
              "",
              "20",
              "10",
              "20",
              "30",
              "20",
              "20"
            ],
            "reliabilities": [
              "",
              "",
              "A",
              "A",
              "A",
              "A",
              "A"
            ]
          },
          {
            "area": {
              "name": "伊豆諸島北部",
              "code": "130020"
            },
            "weatherCodes": [
              "101",
              "101",
              "101",
              "201",
              "201",
              "101",
              "201"
            ],
            "pops": [
              "",
              "20",
              "20",
              "30",
              "30",
              "20",
              "30"
            ],
            "reliabilities": [
              "",
              "",
              "A",
              "A",
              "A",
              "A",
              "A"
            ]
          },
          {
            "area": {
              "name": "伊豆諸島南部",
              "code": "130030"
            },
            "weatherCodes": [
              "210",
              "201",
              "201",
              "200",
              "200",
              "201",
              "201"
            ],
            "pops": [
              "",
              "30",
              "30",
              "40",
              "40",
              "30",
              "30"
            ],
            "reliabilities": [
              "",
              "",
              "A",
              "C",
              "B",
              "A",
              "A"
            ]
          },
          {
            "area": {
              "name": "小笠原諸島",
              "code": "130040"
            },
            "weatherCodes": [
              "214",
              "200",
              "201",
              "201",
              "202",
              "201",
              "201"
            ],
            "pops": [
              "",
              "30",
              "30",
              "30",
              "50",
              "30",
              "30"
            ],
            "reliabilities": [
              "",
              "",
              "A",
              "A",
              "C",
              "A",
              "A"
            ]
          }
        ]
      },
      {
        "timeDefines": [
          "2024-12-04T00:00:00+09:00",
          "2024-12-05T00:00:00+09:00",
          "2024-12-06T00:00:00+09:00",
          "2024-12-07T00:00:00+09:00",
          "2024-12-08T00:00:00+09:00",
          "2024-12-09T00:00:00+09:00",
          "2024-12-10T00:00:00+09:00"
        ],
        "areas": [
          {
            "area": {
              "name": "東京",
              "code": "44132"
            },
            "tempsMin": [
              "",
              "7",
              "7",
              "6",
              "3",
              "4",
              "4"
            ],
            "tempsMinUpper": [
              "",
              "9",
              "8",
              "7",
              "5",
              "6",
              "6"
            ],
            "tempsMinLower": [
              "",
              "6",
              "5",
              "4",
              "2",
              "2",
              "2"
            ],
            "tempsMax": [
              "",
              "16",
              "16",
              "14",
              "12",
              "12",
              "12"
            ],
            "tempsMaxUpper": [
              "",
              "17",
              "17",
              "16",
              "14",
              "15",
              "15"
            ],
            "tempsMaxLower": [
              "",
              "13",
              "14",
              "10",
              "9",
              "10",
              "10"
            ]
          },
          {
            "area": {
              "name": "大島",
              "code": "44172"
            },
            "tempsMin": [
              "",
              "11",
              "10",
              "9",
              "7",
              "7",
              "8"
            ],
            "tempsMinUpper": [
              "",
              "12",
              "12",
              "11",
              "9",
              "9",
              "10"
            ],
            "tempsMinLower": [
              "",
              "9",
              "9",
              "7",
              "6",
              "5",
              "6"
            ],
            "tempsMax": [
              "",
              "17",
              "15",
              "14",
              "13",
              "14",
              "14"
            ],
            "tempsMaxUpper": [
              "",
              "18",
              "17",
              "16",
              "15",
              "16",
              "16"
            ],
            "tempsMaxLower": [
              "",
              "15",
              "14",
              "13",
              "11",
              "12",
              "12"
            ]
          },
          {
            "area": {
              "name": "八丈島",
              "code": "44263"
            },
            "tempsMin": [
              "",
              "12",
              "12",
              "10",
              "9",
              "10",
              "10"
            ],
            "tempsMinUpper": [
              "",
              "14",
              "13",
              "12",
              "11",
              "11",
              "12"
            ],
            "tempsMinLower": [
              "",
              "11",
              "11",
              "9",
              "8",
              "8",
              "8"
            ],
            "tempsMax": [
              "",
              "16",
              "17",
              "16",
              "13",
              "14",
              "15"
            ],
            "tempsMaxUpper": [
              "",
              "17",
              "18",
              "18",
              "16",
              "16",
              "16"
            ],
            "tempsMaxLower": [
              "",
              "15",
              "15",
              "14",
              "12",
              "13",
              "13"
            ]
          },
          {
            "area": {
              "name": "父島",
              "code": "44301"
            },
            "tempsMin": [
              "",
              "19",
              "20",
              "19",
              "19",
              "18",
              "17"
            ],
            "tempsMinUpper": [
              "",
              "22",
              "21",
              "21",
              "21",
              "20",
              "19"
            ],
            "tempsMinLower": [
              "",
              "18",
              "18",
              "18",
              "18",
              "17",
              "16"
            ],
            "tempsMax": [
              "",
              "25",
              "25",
              "25",
              "24",
              "23",
              "22"
            ],
            "tempsMaxUpper": [
              "",
              "26",
              "26",
              "26",
              "26",
              "24",
              "23"
            ],
            "tempsMaxLower": [
              "",
              "24",
              "24",
              "24",
              "23",
              "22",
              "21"
            ]
          }
        ]
      }
    ],
    "tempAverage": {
      "areas": [
        {
          "area": {
            "name": "東京",
            "code": "44132"
          },
          "min": "5.1",
          "max": "13.1"
        },
        {
          "area": {
            "name": "大島",
            "code": "44172"
          },
          "min": "7.7",
          "max": "14.5"
        },
        {
          "area": {
            "name": "八丈島",
            "code": "44263"
          },
          "min": "11.1",
          "max": "16.8"
        },
        {
          "area": {
            "name": "父島",
            "code": "44301"
          },
          "min": "19.1",
          "max": "23.6"
        }
      ]
    },
    "precipAverage": {
      "areas": [
        {
          "area": {
            "name": "東京",
            "code": "44132"
          },
          "min": "2.5",
          "max": "16.5"
        },
        {
          "area": {
            "name": "大島",
            "code": "44172"
          },
          "min": "8.9",
          "max": "31.2"
        },
        {
          "area": {
            "name": "八丈島",
            "code": "44263"
          },
          "min": "23.9",
          "max": "53.8"
        },
        {
          "area": {
            "name": "父島",
            "code": "44301"
          },
          "min": "5.7",
          "max": "34.9"
        }
      ]
    }
  }
]

// 風向き、風速など(1日ごと/3日間) -> weather[0].timeSeries[0]
// console.log(weather[0].timeSeries[0].areas[1])

// 降水確率(6時間ごと*5) -> weather[0].timeSeries[1]
// console.log(weather[0].timeSeries[1].areas[0])

// 降水確率(1日ごと/1週間) -> weather[1].timeSeries[0]
// console.log(weather[1].timeSeries[0].areas[0])

// 気温(1日ごと/1週間) -> weather[1].timeSeries[1]
console.log(weather[1].tempAverage.areas[0])